{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.19.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 3, 36], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["re_lu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_1", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_1", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_2", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_2", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["re_lu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_3", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_3", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling2d", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_4", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_4", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["re_lu_4", 0, 0]]}}, "training_config": {"loss": "mean_squared_error", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "mean_absolute_error", "dtype": "float32", "fn": "mean_absolute_error"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.273695170879364, "scale": 0.008314865009457457, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -6.570615050371956, "scale": 0.04132462295831418, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.4059210562238507, "scale": 0.028148107902676453, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.7013727426528931, "scale": 0.03210797917609121, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.3610326051712036, "scale": 0.011441505189035453, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -3.7798674255025153, "scale": 0.015303106985840143, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -476.66835698146446, "scale": 3.095249071308211, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 7559.31884765625, "scale": 181.94662032781864, "original_dtype": "float32"}}, {"name": "batch_normalization_10/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0, "scale": 0.011987019303784359, "original_dtype": "float32"}}, {"name": "batch_normalization_10/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.582614604398316, "scale": 0.010413768566122241, "original_dtype": "float32"}}, {"name": "batch_normalization_10/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -157.38292810776656, "scale": 1.1922949099073223, "original_dtype": "float32"}}, {"name": "batch_normalization_10/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 22.821163177490234, "scale": 269.4169390659706, "original_dtype": "float32"}}, {"name": "batch_normalization_11/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.30178865790367126, "scale": 0.00771597284896701, "original_dtype": "float32"}}, {"name": "batch_normalization_11/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6143955861820894, "scale": 0.005036029394935159, "original_dtype": "float32"}}, {"name": "batch_normalization_11/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -24.73112128762638, "scale": 0.17665086634018842, "original_dtype": "float32"}}, {"name": "batch_normalization_11/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 139.7285919189453, "scale": 4.793011534447763, "original_dtype": "float32"}}, {"name": "batch_normalization_2/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5128699541091919, "scale": 0.009443394810545678, "original_dtype": "float32"}}, {"name": "batch_normalization_2/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6143965557509777, "scale": 0.005036037342221129, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -63.00361835255343, "scale": 0.5384924645517387, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 234.20880126953125, "scale": 5.742473048789829, "original_dtype": "float32"}}, {"name": "batch_normalization_3/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.009173431433737278, "scale": 0.010414942423356515, "original_dtype": "float32"}}, {"name": "batch_normalization_3/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.3961158838926575, "scale": 0.008892457859188902, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.016583242603376, "scale": 0.033194902831432865, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.415672540664673, "scale": 0.025841910231347177, "original_dtype": "float32"}}, {"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6322038769721985, "scale": 0.007456914817585664, "original_dtype": "float32"}}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.088742733001709, "scale": 0.015829720990914925, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -118.99410484164369, "scale": 1.0530451755897672, "original_dtype": "float32"}}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 5964.37841796875, "scale": 218.88074640012255, "original_dtype": "float32"}}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.18446332216262817, "scale": 0.008159037898568547, "original_dtype": "float32"}}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6143969264684939, "scale": 0.005036040380889294, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -71.65031552782246, "scale": 0.5117879680558747, "original_dtype": "float32"}}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 224.60231018066406, "scale": 10.370458924536612, "original_dtype": "float32"}}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.20940552651882172, "scale": 0.008375309553800845, "original_dtype": "float32"}}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.8352938539841597, "scale": 0.012400634148541619, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.627246447170482, "scale": 0.03824170617496266, "original_dtype": "float32"}}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.6394851207733154, "scale": 0.03199126767177208, "original_dtype": "float32"}}, {"name": "batch_normalization_7/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006937333817283313, "scale": 0.006937333817283313, "original_dtype": "float32"}}, {"name": "batch_normalization_7/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.7443270683288574, "scale": 0.010730017951744445, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -202.7015566358379, "scale": 1.235985101438036, "original_dtype": "float32"}}, {"name": "batch_normalization_7/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 401.6752624511719, "scale": 208.5046588972503, "original_dtype": "float32"}}, {"name": "batch_normalization_8/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.0007249752525240183, "scale": 0.010799568057900258, "original_dtype": "float32"}}, {"name": "batch_normalization_8/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6143968694350299, "scale": 0.0050360399134018845, "original_dtype": "float32"}}, {"name": "batch_normalization_8/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -41.57766912123736, "scale": 0.3299815009622013, "original_dtype": "float32"}}, {"name": "batch_normalization_8/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 116.58705139160156, "scale": 12.193467024260876, "original_dtype": "float32"}}, {"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5038361549377441, "scale": 0.01061402676152248, "original_dtype": "float32"}}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.97139612085679, "scale": 0.013320244059843176, "original_dtype": "float32"}}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -5.237909878001493, "scale": 0.04328851138844209, "original_dtype": "float32"}}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 2.6525492668151855, "scale": 0.05478087219537473, "original_dtype": "float32"}}, {"name": "conv2d/kernel", "shape": [1, 1, 36, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.4751584333531995, "scale": 0.018610213784610523, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -8.84869846643186, "scale": 0.06967479107426662, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -7.702723794824936, "scale": 0.05879941828110639, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -6.879369941412234, "scale": 0.052918230318555644, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -10.942218286850872, "scale": 0.08289559308220358, "original_dtype": "float32"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -6.162399172315411, "scale": 0.050511468625536154, "original_dtype": "float32"}}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -9.033614229688459, "scale": 0.06792191150141698, "original_dtype": "float32"}}, {"name": "conv2d_7/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -5.452585356843238, "scale": 0.04825296775967467, "original_dtype": "float32"}}, {"name": "conv2d_8/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -8.318258973663928, "scale": 0.06254330055386412, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [256, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9954072288438386, "scale": 0.007161203085207472, "original_dtype": "float32"}}]}]}